loadtests/artillery.yml
# Artillery load test configuration for Haiku Battle League API
# Designed to simulate traffic for 5–10M daily active users.
# 1) 10% of users submit battles daily (2 requests per user)
# 2) 50% view leaderboard updates (1 request per user)
# 3) 30% read random haikus (1 request per user)
# The test will run for 30 minutes, ramping up to 10,000 concurrent virtual users.
# Adjust `scenarios` and `target` as required for your environment.
config:
  target: http://localhost:3001
  phases:
    - duration: 60
      arrivalRate: 200
    - duration: 1200
      rampTo: 5000
    - duration: 600
      rampTo: 10000
  http:
    timeout: 30
    followRedirect: false
scenarios:
  register_and_login:
    flow:
      - post:
          url: /api/auth/register
          json:
            email: test@example.com
            password: secret
      - post:
          url: /api/auth/login
          json:
            email: test@example.com
            password: secret
          capture:
            - json: $.token
              as: auth_token
  submit_battle:
    flow:
      - get:
          url: /api/haiku
          qs:
            qty: 2
            excludeUser: '{{auth_token}}'
      - post:
          url: /api/battle
          headers:
            Authorization: 'Bearer {{auth_token}}'
          json:
            winnerId: '{{id.0}}'
            haikuIds: ['{{id.0}}', '{{id.1}}']
  get_leaderboard:
    flow:
      - get:
          url: /api/leaderboard
          qs:
            period: daily
          headers:
            Authorization: 'Bearer {{auth_token}}'
  get_random_haiku:
    flow:
      - get:
          url: /api/haiku
          qs:
            id: '{{randomId}}'